{
  "polyester": {
    "definitions": {
      "english": "A synthetic polymer fiber made from petroleum-based chemicals, primarily polyethylene terephthalate (PET). Polyester is known for its exceptional durability, wrinkle resistance, quick-drying properties, and color retention. It maintains its shape well, resists shrinking and stretching, and can be blended with natural fibers to enhance fabric performance. Widely used in clothing, home textiles, and industrial applications.",
      "bangla": "পলিয়েস্টার একটি কৃত্রিম তন্তু যা পেট্রোলিয়াম-ভিত্তিক রাসায়নিক পদার্থ থেকে তৈরি।"
    },
    "category": "raw_materials",
    "subcategory": "synthetic_fibers",
    "tags": ["synthetic", "durable", "wrinkle_resistant", "quick_dry", "petroleum_based"],
    "relationships": {
      "related": ["nylon", "acrylic", "polypropylene", "spandex"],
      "synonyms": ["PET_fiber", "dacron"],
      "children": ["recycled_polyester", "microfiber_polyester", "polyester_fleece"],
      "parent": "synthetic_fibers"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "dyeing": {
    "definitions": {
      "english": "The process of imparting color to textile materials using dyes, which are substances that chemically or physically bond with fibers to create permanent coloration. Dyeing can be performed at various stages including fiber, yarn, fabric, or garment level, using different methods such as exhaust dyeing, continuous dyeing, or pad-batch dyeing. The process requires careful control of temperature, pH, time, and chemical auxiliaries to achieve desired color depth, uniformity, and fastness properties.",
      "bangla": "রঞ্জনবিদ্যা হল টেক্সটাইল উপকরণে রং প্রয়োগের প্রক্রিয়া।"
    },
    "category": "processes",
    "subcategory": "coloration",
    "tags": ["color", "chemical", "bonding", "fastness", "uniformity"],
    "relationships": {
      "related": ["printing", "bleaching", "finishing"],
      "synonyms": ["coloration", "tinting"],
      "children": ["fiber_dyeing", "yarn_dyeing", "piece_dyeing", "garment_dyeing"],
      "parent": "wet_processing"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "canvas": {
    "definitions": {
      "english": "A heavy-duty, plain weave fabric traditionally made from cotton, linen, or hemp fibers, characterized by its strength, durability, and tight weave structure. Canvas fabrics have high tensile strength and resistance to tearing, making them suitable for applications requiring robust performance such as tents, sails, bags, shoes, and industrial covers. Modern canvas may incorporate synthetic fibers or blends to enhance specific performance characteristics while maintaining the fabric's inherent strength properties.",
      "bangla": "ক্যানভাস একটি ভারী, সরল বোনা কাপড় যা তুলা, লিনেন বা পাট থেকে তৈরি।"
    },
    "category": "fabrics",
    "subcategory": "heavy_duty_fabrics",
    "tags": ["heavy_duty", "plain_weave", "durable", "strong", "industrial"],
    "relationships": {
      "related": ["duck", "drill", "sailcloth"],
      "synonyms": ["duck_cloth", "heavy_cotton"],
      "children": ["cotton_canvas", "linen_canvas", "synthetic_canvas"],
      "parent": "utility_fabrics"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "antimicrobial_finish": {
    "definitions": {
      "english": "A functional textile treatment that inhibits the growth of bacteria, fungi, and other microorganisms on fabric surfaces, reducing odors and maintaining hygiene. These finishes can be applied through various methods including padding, coating, or incorporation during fiber production. Antimicrobial treatments are particularly valuable for activewear, medical textiles, socks, underwear, and home textiles where microbial control enhances performance, comfort, and health benefits while extending product lifespan.",
      "bangla": "অ্যান্টিমাইক্রোবিয়াল ফিনিশ একটি কার্যকরী টেক্সটাইল চিকিত্সা যা ব্যাকটেরিয়া বৃদ্ধি রোধ করে।"
    },
    "category": "finishes",
    "subcategory": "functional_finishes",
    "tags": ["antimicrobial", "hygiene", "odor_control", "health", "performance"],
    "relationships": {
      "related": ["moisture_management", "odor_control", "silver_treatment"],
      "synonyms": ["antibacterial_finish", "biocide_treatment"],
      "children": ["silver_antimicrobial", "copper_antimicrobial", "zinc_antimicrobial"],
      "parent": "health_finishes"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "plain_weave": {
    "definitions": {
      "english": "The most fundamental and common weaving pattern where weft yarns pass alternately over and under warp yarns in a simple one-over-one-under sequence. This creates a balanced, stable fabric structure with maximum interlacement points, resulting in strong, durable fabrics. Plain weave produces fabrics like muslin, canvas, and basic cotton sheeting, and serves as the foundation for many other weave variations.",
      "bangla": "সরল বুনন একটি মৌলিক বুনন পদ্ধতি যেখানে বাণা সুতা তানা সুতার উপর-নিচ দিয়ে যায়।"
    },
    "category": "processes",
    "subcategory": "weaving_patterns",
    "tags": ["weave", "fundamental", "stable", "interlacement", "basic"],
    "relationships": {
      "related": ["twill_weave", "satin_weave", "basket_weave"],
      "synonyms": ["tabby_weave", "one_over_one"],
      "children": ["canvas", "muslin", "percale"],
      "parent": "basic_weaves"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "mercerization": {
    "definitions": {
      "english": "A chemical treatment process for cotton fibers or fabrics using concentrated sodium hydroxide (caustic soda) under tension. This process causes the cotton fibers to swell, straighten, and become more lustrous, stronger, and more receptive to dyes. Mercerized cotton has improved dimensional stability, increased tensile strength, and enhanced dye affinity, resulting in deeper, more vibrant colors and a silk-like appearance.",
      "bangla": "মার্সারাইজেশন তুলার তন্তুর একটি রাসায়নিক প্রক্রিয়া যা সোডিয়াম হাইড্রক্সাইড দিয়ে করা হয়।"
    },
    "category": "processes",
    "subcategory": "chemical_treatments",
    "tags": ["chemical", "cotton", "strengthening", "luster", "dye_affinity"],
    "relationships": {
      "related": ["singeing", "scouring", "bleaching", "dyeing"],
      "synonyms": ["caustic_treatment", "alkali_treatment"],
      "children": ["slack_mercerization", "chain_mercerization"],
      "parent": "finishing_processes"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "loom": {
    "definitions": {
      "english": "A mechanical device or machine used to weave yarn or thread into fabric by interlacing warp and weft yarns at right angles. Looms hold the warp yarns under tension while allowing the weft yarns to be inserted perpendicular to create cloth. Modern looms include shuttle looms, rapier looms, air-jet looms, and water-jet looms, each offering different speeds, fabric qualities, and capabilities for various textile applications.",
      "bangla": "তাঁত একটি যন্ত্র যা সুতা বুনে কাপড় তৈরি করার জন্য ব্যবহৃত হয়।"
    },
    "category": "machinery",
    "subcategory": "weaving_equipment",
    "tags": ["weaving", "machine", "warp", "weft", "fabric_production"],
    "relationships": {
      "related": ["shuttle", "reed", "heddle", "beam"],
      "synonyms": ["weaving_machine", "weaving_loom"],
      "children": ["shuttle_loom", "rapier_loom", "air_jet_loom", "water_jet_loom"],
      "parent": "textile_machinery"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "denim": {
    "definitions": {
      "english": "A sturdy cotton twill fabric characterized by its diagonal ribbing pattern, traditionally woven with indigo-dyed warp yarns and undyed natural weft yarns. The contrast creates the characteristic blue-and-white appearance. Denim is known for its durability, comfort, and distinctive aging properties that improve appearance with wear and washing. Originally used for workwear, it has become a versatile fashion fabric for jeans, jackets, and various garments.",
      "bangla": "ডেনিম একটি মজবুত তুলার কাপড় যা তির্যক বুনন প্যাটার্ন দিয়ে তৈরি।"
    },
    "category": "fabrics",
    "subcategory": "woven_fabrics",
    "tags": ["twill", "cotton", "indigo", "durable", "casual"],
    "relationships": {
      "related": ["chambray", "drill", "duck", "canvas"],
      "synonyms": ["jean_fabric", "dungaree"],
      "children": ["raw_denim", "selvedge_denim", "stretch_denim"],
      "parent": "twill_fabrics"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "waterproofing": {
    "definitions": {
      "english": "A finishing treatment applied to textiles to prevent water penetration while maintaining fabric integrity and, in some cases, breathability. Methods include coating with waterproof membranes, applying chemical treatments, or laminating with barrier films. Waterproof fabrics are essential for outdoor gear, rainwear, and protective clothing. The treatment must balance water resistance with comfort, durability, and specific performance requirements for the intended application.",
      "bangla": "জলরোধী করার প্রক্রিয়া যা কাপড়ে জল ঢোকা প্রতিরোধ করে।"
    },
    "category": "finishes",
    "subcategory": "functional_finishes",
    "tags": ["water_resistant", "coating", "membrane", "outdoor", "protective"],
    "relationships": {
      "related": ["water_repellent", "breathable_coating", "lamination"],
      "synonyms": ["water_blocking", "hydrophobic_treatment"],
      "children": ["PU_coating", "TPU_lamination", "DWR_treatment"],
      "parent": "protective_finishes"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "tensile_strength": {
    "definitions": {
      "english": "A quality control measurement that determines the maximum stress or force a textile material can withstand while being stretched or pulled before breaking or failing. Expressed in units like pounds per square inch (PSI) or Newtons per square meter, tensile strength is crucial for evaluating fabric durability, performance requirements, and suitability for specific applications. Testing follows standardized methods and helps ensure consistent quality in textile production.",
      "bangla": "প্রসার্য শক্তি একটি গুণগত নিয়ন্ত্রণ পরীক্ষা যা কাপড়ের শক্তি মাপে।"
    },
    "category": "quality_control",
    "subcategory": "mechanical_testing",
    "tags": ["testing", "strength", "durability", "mechanical", "measurement"],
    "relationships": {
      "related": ["tear_strength", "burst_strength", "elongation"],
      "synonyms": ["breaking_strength", "ultimate_strength"],
      "children": ["warp_tensile", "weft_tensile", "bias_tensile"],
      "parent": "strength_tests"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "color_fastness": {
    "definitions": {
      "english": "The resistance of colored textiles to fading, bleeding, or color change when exposed to various conditions such as washing, light exposure, perspiration, rubbing, or chemical treatments. Color fastness is measured through standardized testing methods and rated on scales that indicate the degree of color retention. High color fastness ensures that dyed or printed textiles maintain their appearance throughout their intended lifespan and use conditions.",
      "bangla": "রং স্থায়িত্ব হল রংয়ের কাপড়ের বিভিন্ন অবস্থায় রং ধরে রাখার ক্ষমতা।"
    },
    "category": "quality_control",
    "subcategory": "color_testing",
    "tags": ["color", "durability", "washing", "light", "testing"],
    "relationships": {
      "related": ["dye_penetration", "color_bleeding", "light_fastness"],
      "synonyms": ["color_retention", "dye_fastness"],
      "children": ["wash_fastness", "light_fastness", "rub_fastness"],
      "parent": "color_quality"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "pattern_making": {
    "definitions": {
      "english": "The technical process of creating templates or blueprints used to cut fabric pieces for garment construction or textile products. Pattern making involves translating design sketches into precise, scaled templates that account for seam allowances, ease, grading for different sizes, and construction requirements. Modern pattern making utilizes both traditional paper methods and computer-aided design (CAD) systems to ensure accurate fit, efficient fabric usage, and consistent production quality.",
      "bangla": "প্যাটার্ন তৈরি একটি প্রযুক্তিগত প্রক্রিয়া যা পোশাক তৈরির জন্য টেমপ্লেট তৈরি করে।"
    },
    "category": "design",
    "subcategory": "pattern_development",
    "tags": ["design", "template", "cutting", "sizing", "CAD"],
    "relationships": {
      "related": ["grading", "marker_making", "draping", "fitting"],
      "synonyms": ["pattern_drafting", "template_making"],
      "children": ["flat_pattern", "draped_pattern", "digital_pattern"],
      "parent": "garment_development"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "supply_chain": {
    "definitions": {
      "english": "The interconnected network of organizations, processes, and resources involved in producing and delivering textile products from raw material sourcing to final consumer delivery. The textile supply chain typically includes fiber production, yarn manufacturing, fabric production, dyeing and finishing, garment assembly, distribution, and retail. Modern supply chains emphasize transparency, sustainability, ethical practices, and efficient logistics to meet consumer demands and regulatory requirements.",
      "bangla": "সাপ্লাই চেইন হল কাঁচামাল থেকে ভোক্তা পর্যন্ত পণ্য সরবরাহের সংযুক্ত নেটওয়ার্ক।"
    },
    "category": "business",
    "subcategory": "operations_management",
    "tags": ["logistics", "sourcing", "manufacturing", "distribution", "transparency"],
    "relationships": {
      "related": ["procurement", "inventory_management", "vendor_relations"],
      "synonyms": ["value_chain", "production_network"],
      "children": ["upstream_supply", "downstream_supply", "reverse_logistics"],
      "parent": "business_operations"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "organic_cotton": {
    "definitions": {
      "english": "Cotton grown using methods and materials that have low environmental impact, without synthetic pesticides, herbicides, or genetically modified organisms (GMOs). Organic cotton production emphasizes soil health, biodiversity, and sustainable farming practices while meeting strict certification standards. The resulting fiber maintains cotton's natural properties while supporting environmental sustainability and reducing chemical exposure for farmers and consumers throughout the textile production process.",
      "bangla": "জৈব তুলা হল পরিবেশ বান্ধব পদ্ধতিতে চাষ করা তুলা যাতে কৃত্রিম রাসায়নিক ব্যবহার করা হয় না।"
    },
    "category": "sustainability",
    "subcategory": "eco_friendly_materials",
    "tags": ["organic", "sustainable", "pesticide_free", "certified", "eco_friendly"],
    "relationships": {
      "related": ["recycled_cotton", "hemp", "linen", "bamboo_fiber"],
      "synonyms": ["certified_organic_cotton", "eco_cotton"],
      "children": ["GOTS_certified", "OCS_certified"],
      "parent": "sustainable_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "knitting": {
    "definitions": {
      "english": "A method of creating fabric by forming interlocking loops of yarn using needles or specialized machinery. Unlike weaving, knitting creates fabric structure through loop formation, resulting in fabrics with inherent stretch, flexibility, and comfort. Knitting can be performed by hand or machine and includes techniques like weft knitting (circular and flat) and warp knitting. The process produces various fabric types from basic t-shirt jerseys to complex engineered textiles.",
      "bangla": "বুনন একটি পদ্ধতি যা সুতার ফাঁস তৈরি করে কাপড় বানায়।"
    },
    "category": "processes",
    "subcategory": "fabric_construction",
    "tags": ["loops", "stretch", "needles", "machine", "flexible"],
    "relationships": {
      "related": ["weaving", "crocheting", "braiding"],
      "synonyms": ["loop_formation", "needle_work"],
      "children": ["weft_knitting", "warp_knitting", "circular_knitting"],
      "parent": "fabric_formation"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "silk": {
    "definitions": {
      "english": "A natural protein fiber produced by silkworms, primarily the domesticated Bombyx mori species, known for its exceptional luster, smooth texture, and drape. Silk fibers are continuous filaments that can be reeled from cocoons and have unique properties including natural temperature regulation, moisture absorption, and strength despite their fine diameter. Silk is prized for luxury garments, scarves, and home textiles due to its elegant appearance and comfortable wearing characteristics.",
      "bangla": "রেশম একটি প্রাকৃতিক প্রোটিন তন্তু যা রেশম পোকার গুটি থেকে পাওয়া যায়।"
    },
    "category": "raw_materials",
    "subcategory": "natural_fibers",
    "tags": ["natural", "protein", "luxury", "lustrous", "silkworm"],
    "relationships": {
      "related": ["wool", "cotton", "linen"],
      "synonyms": ["silk_fiber", "sericulture_product"],
      "children": ["mulberry_silk", "wild_silk", "peace_silk"],
      "parent": "protein_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "twill_weave": {
    "definitions": {
      "english": "A fundamental weave structure characterized by a diagonal line pattern created when weft yarns pass over one or more warp yarns then under two or more warp yarns in a progressive, staggered sequence. This creates distinctive diagonal ridges or lines across the fabric surface. Twill weaves are stronger and more durable than plain weaves due to fewer interlacement points, and they drape well while being resistant to soiling and wrinkling.",
      "bangla": "তির্যক বুনন একটি মৌলিক বুনন কাঠামো যা তির্যক রেখার প্যাটার্ন তৈরি করে।"
    },
    "category": "processes",
    "subcategory": "weaving_patterns",
    "tags": ["diagonal", "durable", "drape", "pattern", "interlacement"],
    "relationships": {
      "related": ["plain_weave", "satin_weave", "herringbone"],
      "synonyms": ["diagonal_weave", "twill_pattern"],
      "children": ["right_hand_twill", "left_hand_twill", "broken_twill"],
      "parent": "basic_weaves"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "circular_knitting_machine": {
    "definitions": {
      "english": "A specialized textile machinery that produces tubular knitted fabrics by arranging needles in a circular formation. The machine feeds yarn to needles that move in a circular path, creating seamless tubular fabrics or flat fabrics that can be cut and opened. These machines offer high productivity, consistent fabric quality, and versatility for producing various knit structures from basic jerseys to complex patterns, making them essential equipment in modern knitted textile production.",
      "bangla": "বৃত্তাকার বুনন মেশিন একটি বিশেষায়িত যন্ত্র যা নলাকার বোনা কাপড় তৈরি করে।"
    },
    "category": "machinery",
    "subcategory": "knitting_equipment",
    "tags": ["circular", "needles", "tubular", "productivity", "seamless"],
    "relationships": {
      "related": ["flat_knitting_machine", "warp_knitting_machine"],
      "synonyms": ["circular_knitter", "tube_knitting_machine"],
      "children": ["single_jersey_machine", "double_jersey_machine", "rib_machine"],
      "parent": "knitting_machines"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "jersey_knit": {
    "definitions": {
      "english": "A lightweight, stretchy knitted fabric characterized by a smooth face side and a slightly textured back side, created using a basic stockinette stitch on circular or flat knitting machines. Jersey knit fabrics have natural stretch and recovery properties, excellent drape, and comfortable feel against the skin. They are widely used for t-shirts, underwear, casual wear, and activewear due to their flexibility, breathability, and easy care characteristics.",
      "bangla": "জার্সি বোনা একটি হালকা, প্রসারণযোগ্য বোনা কাপড়।"
    },
    "category": "fabrics",
    "subcategory": "knitted_fabrics",
    "tags": ["knit", "stretch", "smooth", "comfortable", "casual"],
    "relationships": {
      "related": ["rib_knit", "interlock", "pique"],
      "synonyms": ["single_jersey", "stockinette"],
      "children": ["cotton_jersey", "modal_jersey", "bamboo_jersey"],
      "parent": "weft_knits"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "flame_retardant_finish": {
    "definitions": {
      "english": "A chemical treatment applied to textiles to reduce flammability, slow flame spread, and improve fire safety characteristics. These finishes work by forming protective barriers, releasing flame-inhibiting gases, or promoting char formation when exposed to heat or flame. Flame retardant treatments are essential for protective clothing, home furnishings, children's sleepwear, and industrial textiles where fire safety regulations require enhanced flame resistance while maintaining fabric performance and comfort.",
      "bangla": "অগ্নি প্রতিরোধী ফিনিশ একটি রাসায়নিক চিকিত্সা যা কাপড়ের দাহ্যতা কমায়।"
    },
    "category": "finishes",
    "subcategory": "safety_finishes",
    "tags": ["fire_safety", "chemical", "protective", "regulations", "char_formation"],
    "relationships": {
      "related": ["anti_static", "waterproofing", "antimicrobial"],
      "synonyms": ["fire_retardant", "FR_treatment"],
      "children": ["inherent_FR", "topical_FR", "back_coating_FR"],
      "parent": "protective_finishes"
    },
    "metadata": {
      "difficulty": "advanced",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "pilling_resistance": {
    "definitions": {
      "english": "A quality measurement that evaluates a fabric's tendency to form small fiber balls or pills on its surface through wear, abrasion, and washing. Pilling occurs when short fibers work loose and tangle together, affecting fabric appearance and consumer satisfaction. Testing methods simulate wear conditions to rate pilling resistance on standardized scales. Fabrics with good pilling resistance maintain smooth appearance longer and are preferred for garments subject to frequent use and laundering.",
      "bangla": "পিলিং প্রতিরোধ ক্ষমতা কাপড়ের পৃষ্ঠে ছোট গোলাকার তন্তুর বল তৈরির প্রবণতা মাপে।"
    },
    "category": "quality_control",
    "subcategory": "appearance_testing",
    "tags": ["pilling", "appearance", "durability", "testing", "consumer_satisfaction"],
    "relationships": {
      "related": ["abrasion_resistance", "fabric_hand", "surface_smoothness"],
      "synonyms": ["pill_resistance", "anti_pilling"],
      "children": ["martindale_pilling", "random_tumble_pilling"],
      "parent": "appearance_retention"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "computer_aided_design": {
    "definitions": {
      "english": "Digital technology systems used in textile and apparel industries for creating, modifying, analyzing, and optimizing designs through specialized software applications. CAD systems enable designers to develop fabric patterns, garment designs, colorways, and technical specifications with precision and efficiency. These tools integrate with manufacturing processes, reduce development time, minimize material waste, and facilitate communication between design, production, and marketing teams throughout the product development cycle.",
      "bangla": "কম্পিউটার সহায়তায় ডিজাইন হল ডিজিটাল প্রযুক্তি সিস্টেম যা টেক্সটাইল ডিজাইনে ব্যবহৃত হয়।"
    },
    "category": "design",
    "subcategory": "digital_design_tools",
    "tags": ["digital", "software", "efficiency", "precision", "integration"],
    "relationships": {
      "related": ["3D_modeling", "pattern_making", "color_matching"],
      "synonyms": ["CAD_systems", "digital_design"],
      "children": ["2D_CAD", "3D_CAD", "pattern_CAD"],
      "parent": "design_technology"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "inventory_management": {
    "definitions": {
      "english": "The systematic approach to ordering, storing, tracking, and controlling textile raw materials, work-in-progress, and finished goods throughout the supply chain. Effective inventory management balances carrying costs with service levels, ensures material availability for production schedules, minimizes obsolescence, and optimizes cash flow. Modern systems utilize technology for real-time tracking, demand forecasting, and automated reordering to maintain efficient operations while meeting customer requirements.",
      "bangla": "ইনভেন্টরি ব্যবস্থাপনা হল কাঁচামাল, চলমান কাজ এবং সমাপ্ত পণ্যের নিয়ন্ত্রণ।"
    },
    "category": "business",
    "subcategory": "operations_management",
    "tags": ["inventory", "tracking", "optimization", "forecasting", "efficiency"],
    "relationships": {
      "related": ["supply_chain", "demand_planning", "warehouse_management"],
      "synonyms": ["stock_management", "inventory_control"],
      "children": ["raw_material_inventory", "WIP_inventory", "finished_goods"],
      "parent": "operations_management"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "recycled_polyester": {
    "definitions": {
      "english": "A sustainable synthetic fiber produced by mechanically or chemically processing post-consumer plastic bottles, textile waste, or other polyester materials back into new polyester fibers. This process reduces landfill waste, decreases petroleum consumption, and lowers environmental impact compared to virgin polyester production. Recycled polyester maintains similar performance characteristics to virgin polyester while supporting circular economy principles and meeting growing consumer demand for environmentally responsible textile products.",
      "bangla": "পুনর্ব্যবহৃত পলিয়েস্টার একটি টেকসই কৃত্রিম তন্তু যা প্লাস্টিক বোতল থেকে তৈরি।"
    },
    "category": "sustainability",
    "subcategory": "recycled_materials",
    "tags": ["recycled", "sustainable", "circular_economy", "plastic_bottles", "eco_friendly"],
    "relationships": {
      "related": ["recycled_cotton", "organic_polyester", "bio_polyester"],
      "synonyms": ["rPET", "eco_polyester"],
      "children": ["bottle_grade_rPET", "textile_waste_polyester"],
      "parent": "recycled_fibers"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "yarn_count": {
    "definitions": {
      "english": "A numerical expression that indicates the fineness or thickness of yarn by representing the relationship between yarn length and weight. Different counting systems are used globally, including English (Ne), metric (Nm), tex, and denier systems. Higher counts generally indicate finer yarns in English and metric systems, while lower counts indicate finer yarns in tex and denier systems. Yarn count directly affects fabric properties such as hand, drape, strength, and appearance.",
      "bangla": "সুতার গণনা হল সুতার সূক্ষ্মতা বা পুরুত্বের একটি সংখ্যাগত প্রকাশ।"
    },
    "category": "raw_materials",
    "subcategory": "yarn_specifications",
    "tags": ["fineness", "measurement", "thickness", "specification", "quality"],
    "relationships": {
      "related": ["twist", "tensile_strength", "yarn_diameter"],
      "synonyms": ["yarn_fineness", "yarn_number"],
      "children": ["english_count", "metric_count", "tex_count"],
      "parent": "yarn_properties"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "nylon": {
    "definitions": {
      "english": "A synthetic polymer fiber made from petroleum-based chemicals through polymerization of diamines and dicarboxylic acids. Nylon is characterized by exceptional strength, elasticity, abrasion resistance, and quick-drying properties. It has excellent recovery from stretching, good dimensional stability, and resistance to chemicals and mildew. Widely used in hosiery, activewear, rope, carpets, and industrial applications where durability and performance are critical.",
      "bangla": "নাইলন একটি কৃত্রিম পলিমার তন্তু যা পেট্রোলিয়াম-ভিত্তিক রাসায়নিক থেকে তৈরি।"
    },
    "category": "raw_materials",
    "subcategory": "synthetic_fibers",
    "tags": ["synthetic", "strong", "elastic", "abrasion_resistant", "quick_dry"],
    "relationships": {
      "related": ["polyester", "spandex", "acrylic", "polypropylene"],
      "synonyms": ["polyamide", "nylon_fiber"],
      "children": ["nylon_6", "nylon_66", "aramid_nylon"],
      "parent": "synthetic_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "wool": {
    "definitions": {
      "english": "A natural protein fiber obtained from the fleece of sheep and other animals such as goats, alpacas, and rabbits. Wool fibers have unique crimped structure that creates insulating air pockets, providing excellent thermal regulation in both warm and cold conditions. The fiber naturally resists wrinkles, repels moisture while absorbing humidity, and has inherent elasticity. Wool's versatility makes it suitable for clothing, blankets, carpets, and technical textiles.",
      "bangla": "উল একটি প্রাকৃতিক প্রোটিন তন্তু যা ভেড়া এবং অন্যান্য প্রাণীর লোম থেকে পাওয়া যায়।"
    },
    "category": "raw_materials",
    "subcategory": "natural_fibers",
    "tags": ["natural", "protein", "insulating", "crimp", "thermal_regulation"],
    "relationships": {
      "related": ["silk", "cotton", "alpaca", "cashmere"],
      "synonyms": ["sheep_wool", "fleece_fiber"],
      "children": ["merino_wool", "lambswool", "virgin_wool"],
      "parent": "protein_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "linen": {
    "definitions": {
      "english": "A natural cellulose fiber derived from the flax plant (Linum usitatissimum) through a complex process of retting, breaking, scutching, and heckling. Linen fibers are among the strongest natural fibers, with excellent moisture absorption, quick-drying properties, and natural antibacterial characteristics. The fabric becomes softer and more comfortable with use and washing, making it ideal for summer clothing, bedding, tablecloths, and high-quality garments requiring durability and breathability.",
      "bangla": "লিনেন একটি প্রাকৃতিক সেলুলোজ তন্তু যা তিসি গাছ থেকে পাওয়া যায়।"
    },
    "category": "raw_materials",
    "subcategory": "natural_fibers",
    "tags": ["natural", "flax", "strong", "breathable", "antibacterial"],
    "relationships": {
      "related": ["cotton", "hemp", "jute", "ramie"],
      "synonyms": ["flax_fiber", "linen_fiber"],
      "children": ["belgian_linen", "irish_linen", "french_linen"],
      "parent": "bast_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "spandex": {
    "definitions": {
      "english": "A synthetic elastomeric fiber known for its exceptional stretch and recovery properties, capable of stretching up to 500% of its original length and returning to its original state. Also known as elastane or Lycra, spandex is typically used in small percentages blended with other fibers to add stretch, comfort, and shape retention to fabrics. Essential for activewear, swimwear, hosiery, and fitted garments requiring flexibility and body-hugging characteristics.",
      "bangla": "স্প্যানডেক্স একটি কৃত্রিম ইলাস্টোমেরিক তন্তু যা ব্যতিক্রমী প্রসারণ ক্ষমতার জন্য পরিচিত।"
    },
    "category": "raw_materials",
    "subcategory": "synthetic_fibers",
    "tags": ["synthetic", "stretch", "recovery", "elastomeric", "flexibility"],
    "relationships": {
      "related": ["polyester", "nylon", "cotton", "rubber"],
      "synonyms": ["elastane", "lycra"],
      "children": ["covered_spandex", "bare_spandex", "core_spun_spandex"],
      "parent": "elastic_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "hemp": {
    "definitions": {
      "english": "A natural bast fiber obtained from the Cannabis sativa plant, known for its exceptional strength, durability, and environmental sustainability. Hemp fibers are naturally resistant to mold, mildew, and UV rays, while being biodegradable and requiring minimal pesticides during cultivation. The fiber softens with washing and wearing, developing improved hand and drape over time. Hemp is used for rope, canvas, clothing, and eco-friendly textiles due to its sustainability credentials.",
      "bangla": "শণ একটি প্রাকৃতিক বাস্ট তন্তু যা ক্যানাবিস সাতিভা গাছ থেকে পাওয়া যায়।"
    },
    "category": "raw_materials",
    "subcategory": "natural_fibers",
    "tags": ["natural", "sustainable", "strong", "UV_resistant", "biodegradable"],
    "relationships": {
      "related": ["linen", "jute", "cotton", "ramie"],
      "synonyms": ["cannabis_fiber", "hemp_fiber"],
      "children": ["industrial_hemp", "textile_hemp"],
      "parent": "bast_fibers"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "satin_weave": {
    "definitions": {
      "english": "A fundamental weave structure characterized by long warp or weft floats that create a smooth, lustrous surface with minimal visible interlacement points. In satin weave, each warp yarn floats over four or more weft yarns before interlacing, creating the characteristic sheen and smooth hand. This weave structure produces fabrics with excellent drape, lustrous appearance, and smooth texture, commonly used for formal wear, lingerie, linings, and luxury home textiles.",
      "bangla": "সাটিন বুনন একটি মৌলিক বুনন কাঠামো যা মসৃণ, উজ্জ্বল পৃষ্ঠ তৈরি করে।"
    },
    "category": "processes",
    "subcategory": "weaving_patterns",
    "tags": ["lustrous", "smooth", "float", "sheen", "drape"],
    "relationships": {
      "related": ["plain_weave", "twill_weave", "sateen"],
      "synonyms": ["satin_structure", "float_weave"],
      "children": ["five_harness_satin", "eight_harness_satin"],
      "parent": "basic_weaves"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "printing": {
    "definitions": {
      "english": "A textile coloration process that applies colored designs, patterns, or images to fabric surfaces using various techniques such as screen printing, digital printing, block printing, or roller printing. Unlike dyeing which colors the entire fabric, printing creates localized color application in specific patterns or designs. The process involves preparing print pastes with dyes or pigments, applying them through printing methods, and fixing the colors through heat or chemical treatment to ensure durability and wash fastness.",
      "bangla": "ছাপাকার্য একটি টেক্সটাইল রঙ প্রক্রিয়া যা কাপড়ের পৃষ্ঠে রঙিন নকশা প্রয়োগ করে।"
    },
    "category": "processes",
    "subcategory": "coloration",
    "tags": ["pattern", "design", "color_application", "localized", "surface"],
    "relationships": {
      "related": ["dyeing", "screen_printing", "digital_printing"],
      "synonyms": ["textile_printing", "fabric_printing"],
      "children": ["screen_printing", "digital_printing", "block_printing", "roller_printing"],
      "parent": "coloration_processes"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "bleaching": {
    "definitions": {
      "english": "A chemical process that removes natural color, impurities, and residual organic matter from textile materials to achieve whiteness or prepare fabrics for dyeing and printing. Bleaching uses oxidizing agents such as hydrogen peroxide, sodium hypochlorite, or chlorine dioxide under controlled conditions of temperature, time, and pH. The process must be carefully monitored to achieve desired whiteness without damaging fiber structure or reducing fabric strength and quality.",
      "bangla": "ব্লিচিং একটি রাসায়নিক প্রক্রিয়া যা টেক্সটাইল উপকরণ থেকে প্রাকৃতিক রং অপসারণ করে।"
    },
    "category": "processes",
    "subcategory": "preparation",
    "tags": ["whitening", "chemical", "oxidizing", "preparation", "purity"],
    "relationships": {
      "related": ["scouring", "dyeing", "finishing"],
      "synonyms": ["whitening", "decolorization"],
      "children": ["hydrogen_peroxide_bleaching", "hypochlorite_bleaching"],
      "parent": "preparation_processes"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "carding": {
    "definitions": {
      "english": "A mechanical process that disentangles, cleans, and intermixes fibers to produce a continuous web or sliver suitable for spinning into yarn. Carding uses wire-covered surfaces on rollers or flat cards to align fibers in a roughly parallel arrangement while removing short fibers, neps, and impurities. The process is essential in converting raw cotton, wool, or man-made fibers into a form suitable for further processing in textile manufacturing, improving fiber alignment and uniformity.",
      "bangla": "কার্ডিং একটি যান্ত্রিক প্রক্রিয়া যা তন্তুগুলিকে পরিষ্কার করে এবং মিশ্রিত করে।"
    },
    "category": "processes",
    "subcategory": "fiber_preparation",
    "tags": ["mechanical", "fiber_alignment", "cleaning", "preparation", "web"],
    "relationships": {
      "related": ["combing", "drawing", "spinning"],
      "synonyms": ["fiber_carding", "web_formation"],
      "children": ["cotton_carding", "wool_carding", "synthetic_carding"],
      "parent": "spinning_preparation"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "spinning": {
    "definitions": {
      "english": "The process of converting prepared fibers into continuous yarn by drawing out and twisting fiber assemblies to create strength, cohesion, and desired characteristics. Spinning involves attenuating prepared fiber slivers while inserting twist to bind the fibers together, creating yarn suitable for weaving, knitting, or other textile processes. Modern spinning systems include ring spinning, open-end spinning, and air-jet spinning, each producing yarns with different properties and suitable for various end uses.",
      "bangla": "সুতা কাটার প্রক্রিয়া প্রস্তুত তন্তুগুলিকে ক্রমাগত সুতায় রূপান্তরিত করে।"
    },
    "category": "processes",
    "subcategory": "yarn_formation",
    "tags": ["yarn_formation", "twist", "attenuation", "continuous", "mechanical"],
    "relationships": {
      "related": ["carding", "drawing", "winding"],
      "synonyms": ["yarn_spinning", "thread_formation"],
      "children": ["ring_spinning", "open_end_spinning", "air_jet_spinning"],
      "parent": "yarn_manufacturing"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "warping": {
    "definitions": {
      "english": "A preparatory process in weaving that involves winding predetermined lengths of yarn from individual packages onto a large beam in a parallel arrangement to form the warp sheet. Warping ensures uniform tension, correct yarn spacing, and proper alignment of warp yarns before mounting on the loom. The process includes sectional warping and direct warping methods, both critical for achieving consistent fabric quality, proper shed formation, and efficient weaving operations.",
      "bangla": "ওয়ার্পিং তাঁতের একটি প্রস্তুতিমূলক প্রক্রিয়া যা সুতাকে সমান্তরাল বিন্যাসে বিম করে।"
    },
    "category": "processes",
    "subcategory": "weaving_preparation",
    "tags": ["preparation", "warp", "tension", "alignment", "beam"],
    "relationships": {
      "related": ["sizing", "drawing_in", "weaving"],
      "synonyms": ["warp_winding", "beam_preparation"],
      "children": ["sectional_warping", "direct_warping"],
      "parent": "weaving_preparation"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "sizing": {
    "definitions": {
      "english": "A preparatory treatment applied to warp yarns before weaving to increase their strength, reduce hairiness, and improve abrasion resistance during the weaving process. Sizing involves applying a protective film of starch, PVA, or synthetic polymers to yarn surfaces, followed by controlled drying. This treatment prevents yarn breakage during weaving, reduces loom stoppages, improves weaving efficiency, and ensures consistent fabric quality by protecting warp yarns from mechanical stress and friction.",
      "bangla": "সাইজিং তাঁতের আগে ওয়ার্প সুতায় প্রয়োগ করা একটি প্রস্তুতিমূলক চিকিত্সা।"
    },
    "category": "processes",
    "subcategory": "weaving_preparation",
    "tags": ["warp_protection", "strength", "abrasion_resistance", "preparation", "film"],
    "relationships": {
      "related": ["warping", "weaving", "desizing"],
      "synonyms": ["warp_sizing", "yarn_sizing"],
      "children": ["starch_sizing", "synthetic_sizing", "PVA_sizing"],
      "parent": "weaving_preparation"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "shuttle_loom": {
    "definitions": {
      "english": "A traditional weaving machine that inserts weft yarn across the warp sheet using a shuttle, which carries the weft yarn back and forth through the shed formed by alternating warp yarns. Shuttle looms operate at slower speeds than modern shuttleless looms but produce fabrics with distinctive selvedges and are preferred for certain specialty fabrics, heritage textiles, and applications requiring specific fabric characteristics. The shuttle mechanism creates firm, well-finished fabric edges.",
      "bangla": "শাটল তাঁত একটি ঐতিহ্যবাহী বুনন মেশিন যা শাটল ব্যবহার করে বাণা সুতা প্রবেশ করায়।"
    },
    "category": "machinery",
    "subcategory": "weaving_equipment",
    "tags": ["traditional", "shuttle", "selvedge", "slower_speed", "heritage"],
    "relationships": {
      "related": ["rapier_loom", "air_jet_loom", "water_jet_loom"],
      "synonyms": ["traditional_loom", "shuttle_weaving"],
      "children": ["automatic_shuttle", "non_automatic_shuttle"],
      "parent": "weaving_looms"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "low",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "air_jet_loom": {
    "definitions": {
      "english": "A high-speed shuttleless weaving machine that uses compressed air to propel weft yarn across the warp sheet through a series of precisely timed air jets. Air jet looms achieve high production speeds, excellent fabric quality, and versatility in handling various yarn types and fabric constructions. The air insertion system eliminates the need for shuttles, reduces mechanical wear, and allows for quick pattern changes and efficient operation in modern textile manufacturing facilities.",
      "bangla": "এয়ার জেট তাঁত একটি উচ্চ গতির শাটলবিহীন বুনন মেশিন যা সংকুচিত বায়ু ব্যবহার করে।"
    },
    "category": "machinery",
    "subcategory": "weaving_equipment",
    "tags": ["high_speed", "shuttleless", "compressed_air", "efficient", "versatile"],
    "relationships": {
      "related": ["water_jet_loom", "rapier_loom", "shuttle_loom"],
      "synonyms": ["pneumatic_loom", "air_insertion_loom"],
      "children": ["single_nozzle", "multi_nozzle"],
      "parent": "shuttleless_looms"
    },
    "metadata": {
      "difficulty": "advanced",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "rapier_loom": {
    "definitions": {
      "english": "A shuttleless weaving machine that uses flexible steel tapes or rigid rods called rapiers to carry weft yarn across the warp sheet. Rapier looms offer precise weft insertion control, excellent versatility for various yarn types including delicate fibers, and the ability to weave complex patterns with multiple weft colors. These looms provide consistent fabric quality, reduced yarn waste, and efficient operation while handling a wide range of fabric constructions from fine to heavy weight materials.",
      "bangla": "র‍্যাপিয়ার তাঁত একটি শাটলবিহীন বুনন মেশিন যা নমনীয় ইস্পাত টেপ ব্যবহার করে।"
    },
    "category": "machinery",
    "subcategory": "weaving_equipment",
    "tags": ["shuttleless", "flexible_tape", "versatile", "precise_control", "multiple_colors"],
    "relationships": {
      "related": ["air_jet_loom", "water_jet_loom", "shuttle_loom"],
      "synonyms": ["tape_loom", "rapier_weaving"],
      "children": ["single_rapier", "double_rapier"],
      "parent": "shuttleless_looms"
    },
    "metadata": {
      "difficulty": "advanced",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "flat_knitting_machine": {
    "definitions": {
      "english": "A knitting machine with needles arranged in a flat bed configuration that produces flat knitted fabrics by moving yarn across needles in back-and-forth motions. Flat knitting machines are capable of producing shaped knitted panels, complex stitch patterns, and fully-fashioned garment pieces with minimal waste. These machines offer versatility for creating various knit structures, gauge options, and pattern capabilities, making them ideal for fashion knitwear, technical textiles, and specialized knitted products.",
      "bangla": "ফ্ল্যাট নিটিং মেশিন একটি বুনন মেশিন যার সূঁচগুলি সমতল বিছানা কনফিগারেশনে সাজানো।"
    },
    "category": "machinery",
    "subcategory": "knitting_equipment",
    "tags": ["flat_bed", "shaped_panels", "versatile", "fashion", "fully_fashioned"],
    "relationships": {
      "related": ["circular_knitting_machine", "warp_knitting_machine"],
      "synonyms": ["flat_bed_machine", "v_bed_machine"],
      "children": ["manual_flat", "semi_automatic", "computerized_flat"],
      "parent": "knitting_machines"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "warp_knitting_machine": {
    "definitions": {
      "english": "A specialized knitting machine that creates fabric by forming loops with multiple yarns running in the lengthwise direction simultaneously. Warp knitting produces stable, run-resistant fabrics with excellent dimensional stability and strength characteristics. The machine uses guide bars to control yarn movement and creates interlocked loop structures that result in fabrics suitable for lingerie, activewear, technical textiles, and applications requiring stability and strength without excessive stretch properties.",
      "bangla": "ওয়ার্প নিটিং মেশিন একটি বিশেষায়িত বুনন মেশিন যা দৈর্ঘ্যের দিকে একাধিক সুতা দিয়ে ফ্যাব্রিক তৈরি করে।"
    },
    "category": "machinery",
    "subcategory": "knitting_equipment",
    "tags": ["lengthwise", "stable", "run_resistant", "guide_bars", "interlocked"],
    "relationships": {
      "related": ["circular_knitting_machine", "flat_knitting_machine"],
      "synonyms": ["warp_knitter", "tricot_machine"],
      "children": ["tricot_machine", "raschel_machine", "milanese_machine"],
      "parent": "knitting_machines"
    },
    "metadata": {
      "difficulty": "advanced",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "tricot": {
    "definitions": {
      "english": "A warp knitted fabric characterized by fine vertical wales on the face side and crosswise ribs on the back side, created using tricot knitting machines. Tricot fabrics have excellent dimensional stability, smooth surface texture, and resistance to runs and ladders. The fabric drapes well, has controlled stretch properties, and is commonly used for lingerie, linings, activewear, and technical applications where stable, comfortable, and durable knitted fabric performance is required.",
      "bangla": "ট্রাইকট একটি ওয়ার্প বোনা কাপড় যা সামনের দিকে সূক্ষ্ম উল্লম্b ওয়েল দ্বারা চিহ্নিত।"
    },
    "category": "fabrics",
    "subcategory": "knitted_fabrics",
    "tags": ["warp_knit", "dimensional_stability", "run_resistant", "wales", "smooth"],
    "relationships": {
      "related": ["raschel", "jersey_knit", "interlock"],
      "synonyms": ["tricot_knit", "warp_knitted_tricot"],
      "children": ["single_bar_tricot", "two_bar_tricot"],
      "parent": "warp_knits"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "interlock": {
    "definitions": {
      "english": "A double-knit fabric structure created by interlocking two separate jersey knit fabrics, resulting in a stable, smooth fabric with identical appearance on both sides. Interlock fabrics have excellent dimensional stability, good opacity, and superior shape retention compared to single jersey knits. The double-layer construction provides enhanced durability, comfort, and professional appearance, making interlock ideal for polo shirts, blouses, children's wear, and applications requiring stable knitted fabric performance.",
      "bangla": "ইন্টারলক একটি ডাবল-বোনা ফ্যাব্রিক কাঠামো যা দুটি পৃথক জার্সি বোনা কাপড় আন্তঃলক করে তৈরি।"
    },
    "category": "fabrics",
    "subcategory": "knitted_fabrics",
    "tags": ["double_knit", "stable", "identical_sides", "shape_retention", "opacity"],
    "relationships": {
      "related": ["jersey_knit", "rib_knit", "pique"],
      "synonyms": ["double_jersey", "interlock_knit"],
      "children": ["cotton_interlock", "polyester_interlock"],
      "parent": "double_knits"
    },
    "metadata": {
      "difficulty": "intermediate",
      "frequency": "medium",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "rib_knit": {
    "definitions": {
      "english": "A knitted fabric structure characterized by alternating knit and purl stitches arranged in vertical columns, creating pronounced ridges and valleys with exceptional elasticity and recovery properties. Rib knits have superior stretch and return characteristics, making them ideal for areas requiring snug fit and comfort such as cuffs, waistbands, necklines, and full garments. The fabric structure provides excellent shape retention and is commonly produced in various rib configurations like 1x1, 2x1, or 2x2.",
      "bangla": "রিব বোনা একটি বোনা কাপড়ের কাঠামো যা উল্লম্b কলামে বিকল্প বোনা এবং পার্ল সেলাই দ্বারা চিহ্নিত।"
    },
    "category": "fabrics",
    "subcategory": "knitted_fabrics",
    "tags": ["knit_purl", "elastic", "ridges", "stretch_recovery", "vertical_columns"],
    "relationships": {
      "related": ["jersey_knit", "interlock", "cable_knit"],
      "synonyms": ["ribbing", "rib_fabric"],
      "children": ["1x1_rib", "2x1_rib", "2x2_rib"],
      "parent": "weft_knits"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  },
  "fleece": {
    "definitions": {
      "english": "A knitted fabric with a brushed or napped surface that creates a soft, insulating pile, typically made from polyester or cotton fibers. Fleece fabrics have excellent thermal insulation properties due to air trapping in the raised fiber surface, while maintaining breathability and moisture-wicking characteristics. The fabric is lightweight, quick-drying, and easy-care, making it popular for activewear, outdoor clothing, blankets, and casual wear where warmth and comfort are priorities.",
      "bangla": "ফ্লিস একটি বোনা কাপড় যার ব্রাশ করা বা ন্যাপ করা পৃষ্ঠ রয়েছে যা নরম, অন্তরক পাইল তৈরি করে।"
    },
    "category": "fabrics",
    "subcategory": "brushed_fabrics",
    "tags": ["brushed", "insulating", "pile", "thermal", "moisture_wicking"],
    "relationships": {
      "related": ["polar_fleece", "sherpa", "terry"],
      "synonyms": ["fleece_fabric", "polar_fleece"],
      "children": ["micro_fleece", "anti_pill_fleece", "sherpa_fleece"],
      "parent": "pile_fabrics"
    },
    "metadata": {
      "difficulty": "basic",
      "frequency": "high",
      "last_updated": "2024-01-15",
      "source": "textile_handbook_2024"
    }
  }
}
